// أذكار الصباح
const morningAzkar = `
  (1) أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ...
  (2) اللّهُ لا إله إلا هو الحي القيوم...
  (3) اللّهُـمَّ أَنْتَ رَبِّي لا إلهَ إلاّ أَنْتَ...
  (4) اللّهُـمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ...
  سلاممم
`;

// أذكار المساء
const eveningAzkar = `
  1. أَمْسَيْنا وَأَمْسَى المـلكُ للهِ...
  2. اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ...
  (بقية الأذكار...)
`;

// وظيفة لعرض الأذكار بناءً على الاختيار
function showAzkar(timeOfDay) {
  let azkarText = timeOfDay === 'morning' ? morningAzkar : eveningAzkar;
  document.getElementById('azkarText').innerHTML = azkarText.replace(/\n/g, '<br/>'); // استبدال الأسطر الجديدة بـ <br> لإظهار الأذكار بشكل صحيح
}
